<!DOCTYPE HTML PUBLIC "-//W3C//DTD HTML 4.0 Transitional//EN">
<html>
<head>
<title>eWebEditPro</title>
<meta http-equiv=Content-Type content="text/html; charset=utf-8">

<!--

	Include ewebeditpro.js.
	
	If it is in a different directory, specify the path.
	
	For example, src="/ewebeditpro4/ewebeditpro.js"
	
-->
<script language="JavaScript1.2" src="../../../ewebeditpro.js"></script>

</head>
<body style="font-family:Verdana,sans-serif">
<font size=2>
<p>Text inside the editor appears in any language supported by the browser. The tooltips and dialog boxes appear in any language supported by the operating system. Characters not supported appear as question marks (?).</p>
<ul>
<li>To view a tooltip, move the cursor over a toolbar button.</li>
<li>To view a dialog box, click the Picture (<img src="image.gif" width="16" height="16" alt="" border="0">) or Table (<img src="table.gif" width="17" height="15" alt="" border="0">) button.<br>
<font size=1>Exception: The Font Color dialog box displays in the language of the operating system, regardless of the language selected.</font></li>
</ul>
</font>
<center>
<form name="frmname" method="post">
<input type=hidden name="MyContent1" value="Multiple languages can appear in the editor simultaneously.&lt;table border=&quot;0&quot; bordercolor=&quot;#0080c0&quot; cellpadding=&quot;4&quot; cellspacing=&quot;0&quot; width=&quot;100%&quot;&gt;
&lt;tbody&gt;
&lt;tr&gt;
&lt;td valign=&quot;top&quot; width=&quot;50%&quot;&gt;
&lt;h3&gt;Arabic&lt;/h3&gt;

&lt;p dir='rtl'&gt;&#1573;&#1606; &#1575;&#1604;&#1589;&#1601;&#1581;&#1577; &#1575;&#1604;&#1578;&#1610; &#1578;&#1581;&#1575;&#1608;&#1604; &#1593;&#1585;&#1590;&#1607;&#1575; &#1578;&#1581;&#1578;&#1608;&#1610; &#1593;&#1604;&#1609; &#1576;&#1585;&#1606;&#1575;&#1605;&#1580; &#1601;&#1585;&#1593;&#1610; &#1604;&#1578;&#1581;&#1585;&#1610;&#1585; &#1576;&#1585;&#1606;&#1575;&#1605;&#1580; eWebEditPro &#1604;&#1588;&#1585;&#1603;&#1577; &#1575;&#1603;&#1578;&#1585;&#1608;&#1606;. &#1601;&#1607;&#1608; &#1587;&#1610;&#1592;&#1607;&#1585; &#1590;&#1605;&#1606; &#1606;&#1591;&#1575;&#1602; &#1606;&#1592;&#1575;&#1605; &#1575;&#1587;&#1578;&#1593;&#1585;&#1575;&#1590; &#1608;&#1575;&#1587;&#1578;&#1591;&#1604;&#1575;&#1593; &#1575;&#1604;&#1605;&#1581;&#1578;&#1608;&#1610;&#1575;&#1578; browser &#1575;&#1604;&#1578;&#1575;&#1576;&#1593; &#1604;&#1603;&#1605;. &#1573;&#1606;&#1607; &#1610;&#1587;&#1605;&#1581; &#1604;&#1603;&#1605; &#1575;&#1583;&#1582;&#1575;&#1604; &#1605;&#1581;&#1578;&#1608;&#1610;&#1575;&#1578; &#1589;&#1601;&#1581;&#1575;&#1578; &#1608;&#1610;&#1576; &#1576;&#1587;&#1607;&#1608;&#1604;&#1577; &#1608;&#1584;&#1604;&#1603; &#1576;&#1575;&#1587;&#1578;&#1593;&#1605;&#1575;&#1604; &#1608;&#1581;&#1583;&#1577; &#1605;&#1593;&#1575;&#1604;&#1580;&#1577; &#1604;&#1604;&#1603;&#1604;&#1605;&#1575;&#1578;.&lt;/p&gt;
&lt;h3&gt;Chinese (Simplified)&lt;/h3&gt;

&lt;p&gt;&#24744;&#35797;&#22270;&#26597;&#30475;&#30340;&#32593;&#39029;&#21253;&#21547; Ektron &#30340; eWebEditPro &#32534;&#36753;&#22120;&#12290;&#23427;&#23558;&#20986;&#29616;&#22312;&#24744;&#30340;&#27983;&#35272;&#22120;&#20869;&#12290;&#23427;&#20351;&#24744;&#20026;&#32593;&#39029;&#36755;&#20837;&#20869;&#23481;&#22914;&#21516;&#20351;&#29992;&#25991;&#23383;&#22788;&#29702;&#22120;&#19968;&#26679;&#36731;&#26494;&#12290;&lt;/p&gt;

&lt;h3&gt;Chinese (Traditional)&lt;/h3&gt;

&lt;p&gt;&#24744;&#35430;&#22294;&#26597;&#30475;&#30340;&#32178;&#38913;&#21253;&#21547; Ektron &#30340; eWebEditPro &#32232;&#36655;&#22120;&#12290; &#23427;&#23559;&#20986;&#29694;&#22312;&#24744;&#30340;&#28687;&#35261;&#22120;&#20043;&#20013;&#12290; &#23427;&#20351;&#24744;&#28858;&#32178;&#38913;&#36664;&#20837;&#20839;&#23481;&#22914;&#21516;&#20351;&#29992;&#25991;&#23383;&#34389;&#29702;&#22120;&#19968;&#27171;&#36629;&#26494;&#12290;&lt;/p&gt;

&lt;h3&gt;Danish&lt;/h3&gt;

&lt;p&gt;Den side, du pr&#248;ver at f&#229; vist, indeholder Ektrons editor eWebEditPro. Den vises i din browser. Ved hj&#230;lp af denne kan du indtaste indhold til websider lige s&#229; nemt, som hvis du bruger et tekstbehandlingsprogram.&lt;/p&gt;

&lt;h3&gt;Dutch&lt;/h3&gt;

&lt;p&gt;De pagina die u probeert te bekijken bevat Ektron's eWebEditPro editor. Deze verschijnt in het venster van uw browser. Hij stelt u in staat om content voor web pagina's in te voeren met het gemak van een tekstverwerkingsprogramma.&lt;/p&gt;

&lt;h3&gt;English&lt;/h3&gt;

&lt;p&gt;The page you are trying to view contains Ektron's eWebEditPro editor. It will appear within your browser. It allows you to enter content for web pages as easily as using a word processor.&lt;/p&gt;

&lt;h3&gt;French&lt;/h3&gt;

&lt;p&gt;La page que vous voulez afficher contient l'&#233;diteur eWebEditPro de Ektron. Il s'affichera dans votre navigateur. Il vous permet d'entrer du contenu pour des pages web aussi facilement que dans un traitement de texte.&lt;/p&gt;

&lt;h3&gt;German&lt;/h3&gt;

&lt;p&gt;Die Seite, die Sie anzeigen m&#246;chten, enth&#228;lt den Ektron eWebEditPro Editor. Dieser erscheint in Ihrem Browser. Mit diesem k&#246;nnen Sie Inhalt f&#252;r Web-Seiten ebenso komfortabel eingeben wie mit einem Textverarbeitungsprogramm.&lt;/p&gt;
&lt;/td&gt;
&lt;td valign=&quot;top&quot; width=&quot;50%&quot;&gt;
&lt;h3&gt;Hebrew&lt;/h3&gt;

&lt;p dir='rtl'&gt;&#1492;&#1506;&#1502;&#1493;&#1491; &#1513;&#1488;&#1514;&#1492; &#1502;&#1504;&#1505;&#1492; &#1500;&#1512;&#1488;&#1493;&#1514; &#1502;&#1499;&#1497;&#1500; &#1488;&#1514; &#1514;&#1493;&#1499;&#1504;&#1514; &#1492;&#1506;&#1512;&#1497;&#1499;&#1492; eWebEditPro &#1513;&#1500; Ektron. &#1492;&#1514;&#1493;&#1499;&#1504;&#1492; &#1514;&#1493;&#1508;&#1497;&#1506; &#1489;&#1491;&#1508;&#1491;&#1508;&#1503; &#1513;&#1500;&#1498;. &#1492;&#1514;&#1493;&#1499;&#1504;&#1492; &#1502;&#1488;&#1508;&#1513;&#1512;&#1514; &#1500;&#1492;&#1494;&#1497;&#1503; &#1514;&#1493;&#1499;&#1503; &#1500;&#1506;&#1502;&#1493;&#1491;&#1497; &#1488;&#1497;&#1504;&#1496;&#1512;&#1504;&#1496;, &#1489;&#1488;&#1493;&#1514;&#1492; &#1511;&#1500;&#1493;&#1514; &#1499;&#1502;&#1493; &#1489;&#1513;&#1497;&#1502;&#1493;&#1513; &#1489;&#1502;&#1506;&#1489;&#1491; &#1514;&#1502;&#1500;&#1497;&#1500;&#1497;&#1501;.&lt;/p&gt;
&lt;h3&gt;Italian&lt;/h3&gt;

&lt;p&gt;La pagina che state cercando di visualizzare contiene l'editor di Ektron eWebEditPro. Comparir&#224; all'interno del browser. Permette di inserire contenuti per le pagine web in modo semplice, come con un word processor.&lt;/p&gt;

&lt;h3&gt;Japanese&lt;/h3&gt;

&lt;p&gt;&#12371;&#12398;&#12506;&#12540;&#12472;&#12395;&#12399;&#12289;Ektron&#31038;&#12398;eWebEditPro&#12456;&#12487;&#12451;&#12479;&#12364;&#21547;&#12414;&#12428;&#12414;&#12377;&#12290;&#12371;&#12398;&#12456;&#12487;&#12451;&#12479;&#12399;&#12289;&#12372;&#20351;&#29992;&#12398;&#12502;&#12521;&#12454;&#12470;&#12395;&#34920;&#31034;&#12373;&#12428;&#12414;&#12377;&#12290;eWebEditPro&#12456;&#12487;&#12451;&#12479;&#12434;&#20351;&#12358;&#12392;&#12289;&#12527;&#12540;&#12503;&#12525;&#12434;&#20351;&#29992;&#12377;&#12427;&#25163;&#36605;&#12373;&#12391;Web&#12506;&#12540;&#12472;&#12398;&#20869;&#23481;&#12434;&#20837;&#21147;&#12391;&#12365;&#12414;&#12377;&#12290;&lt;/p&gt;

&lt;h3&gt;Korean&lt;/h3&gt;

&lt;p&gt;&#50668;&#47084;&#48516;&#51060; &#48372;&#47140;&#44256; &#49884;&#46020;&#54616;&#45716; &#54168;&#51060;&#51648;&#50640;&#45716; Ektron&#51032; eWebEditPro &#50640;&#46356;&#53552;&#44032; &#54252;&#54632;&#46104;&#50612; &#51080;&#49845;&#45768;&#45796;. &#51060;&#44163;&#51008; &#50668;&#47084;&#48516;&#51032; &#48652;&#46972;&#50864;&#51200;&#50640;&#49436; &#45208;&#53440;&#45208;&#44172; &#46121;&#45768;&#45796;. &#51060;&#45716; &#50892;&#46300; &#54532;&#47196;&#49464;&#49436;&#47484; &#49324;&#50857;&#54616;&#45716; &#44163;&#52376;&#47100; &#49688;&#50900;&#54616;&#44172; &#50937;&#54168;&#51060;&#51648;&#51032; &#45236;&#50857;&#50640; &#46308;&#50612;&#44040; &#49688; &#51080;&#46020;&#47197; &#54644;&#51469;&#45768;&#45796;.&lt;/p&gt;

&lt;h3&gt;Portuguese&lt;/h3&gt;

&lt;p&gt;A p&#225;gina que est&#225; a tentar visualizar cont&#233;m o editor eWebEditPro da Ektron. O editor aparece no browser. Permite introduzir conte&#250;dos em p&#225;ginas Web t&#227;o facilmente como se estivesse a utilizar um processador de texto.&lt;/p&gt;

&lt;h3&gt;Russian&lt;/h3&gt;

&lt;p&gt;&#1057;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094;&#1072; &#1082;&#1086;&#1090;&#1086;&#1088;&#1091;&#1102; &#1074;&#1099; &#1087;&#1088;&#1086;&#1089;&#1084;&#1072;&#1090;&#1088;&#1080;&#1074;&#1072;&#1077;&#1090;&#1077; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1090; Ektron's eWebEditPro &#1088;&#1077;&#1076;&#1072;&#1082;&#1090;&#1086;&#1088;. &#1054;&#1085; &#1087;&#1086;&#1103;&#1074;&#1080;&#1090;&#1100;&#1089;&#1103; &#1074; &#1074;&#1072;&#1096;&#1077;&#1084; &#1073;&#1088;&#1072;&#1091;&#1079;&#1077;&#1088;&#1077;. &#1054;&#1085; &#1088;&#1072;&#1079;&#1088;&#1077;&#1096;&#1080;&#1090; &#1087;&#1088;&#1086;&#1089;&#1084;&#1086;&#1090;&#1088;&#1077;&#1090;&#1100; &#1089;&#1086;&#1076;&#1077;&#1088;&#1078;&#1080;&#1084;&#1086;&#1077; web &#1089;&#1090;&#1088;&#1072;&#1085;&#1080;&#1094; &#1090;&#1072;&#1082;&#1078;&#1077; &#1083;&#1077;&#1075;&#1082;&#1086; &#1082;&#1072;&#1082; &#1080;&#1089;&#1087;&#1086;&#1083;&#1100;&#1079;&#1086;&#1074;&#1072;&#1090;&#1100; word processor.&lt;/p&gt;

&lt;h3&gt;Spanish&lt;/h3&gt;

&lt;p&gt;La p&#225;gina que intenta visualizar contiene el editor eWebEditPro de Ektron. Aparecer&#225; en su navegador. Le permite introducir contenido para p&#225;ginas web con la misma facilidad con la que escribe en su procesador de textos.&lt;/p&gt;

&lt;h3&gt;Swedish&lt;/h3&gt;

&lt;p&gt;Sidan du f&#246;rs&#246;ker titta p&#229; inneh&#229;ller eWebEditPro redigeraren. Den kommer att visas i din webb-l&#228;sare. Programmet g&#246;r att du kan &#228;ndra din webb-sida lika enkelt som n&#228;r du skriver ett word dokument.&lt;/p&gt;
&lt;/td&gt;
&lt;/tr&gt;
&lt;/tbody&gt;
&lt;/table&gt;
"> 
<br>
<script language="JavaScript">
<!--

var localeName;
var charSet;
var selectedLanguage;

with (parent.header.document.frmSelect.language)
{
selectedLanguage = options[selectedIndex].value;
}
var len = selectedLanguage.length;
var pairSplit = selectedLanguage.indexOf(",");
localeName = selectedLanguage.substring(0,pairSplit);
charSet = selectedLanguage.substring(pairSplit+1);

document.charset = charSet;
eWebEditPro.parameters.locale = eWebEditPro.parameters.path + localeName;

eWebEditPro.create("MyContent1", "100%", 400);

function preview(strEditorName) {
	// may be async
	eWebEditPro.save(null, function () {
	var objElem = eWebEditPro.instances[strEditorName].linkedElement();
	var win = window.open("", "Preview", "width=800,height=500,resizable,scrollbars,status,titlebar"); 
	if (null == win)
	{
		alert("Unable to open pop-up window.  Please turn off your pop-up blocker and try again.");
	}
	else
	{
		with (win.document) {
		  open("text/html", "replace");
		  var style = "";
		  if (eWebEditPro.instances[strEditorName].editor)
		  {
		  	style = eWebEditPro.instances[strEditorName].editor.getPropertyString("StyleSheet");
		  }
		  if (0 == style.length) // default
		  {
			style = eWebEditPro.parameters.path + "ektnormal.css"; // from config.xml
	      } 
		  writeln("<HTML><HEAD><TITLE>Preview Page</TITLE><link rel='stylesheet' type='text/css' href='" + style +"'><meta http-equiv=Content-Type content='text/html; charset=" + charSet + "'></HEAD><BODY><form>\n");
		  writeln(objElem.value);
		  writeln("<BR><BR><BR><center>");
		  writeln("<input type='button' value='Close' onClick='javascript:self.close();'>");
		  writeln("</center></form></BODY></HTML>");
		  close();
		} // end with
	}
	}); // end async
}
//-->
</script>
<BR>

<input type="button" value="Preview" onClick="preview('MyContent1');">

</form>
</center>
</body>
</html>